Revit 2027 API
ViewSystemsAnalysisReport.SystemsAnalysisOutputFolder Property
 The full path of the output folder for systems analysis.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SystemsAnalysisOutputFolder { get; }
Public ReadOnly Property SystemsAnalysisOutputFolder As String
	Get
public:
property String^ SystemsAnalysisOutputFolder {
	String^ get ();
}
member SystemsAnalysisOutputFolder : string with get
Property Value
String
See Also
Reference
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace